; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v4 ?v6)
             (pred_3 ?v2 ?v3)
             (pred_7 ?v4 ?v3)
             (pred_1 ?v12 ?v4 )
	     (pred_4 ?v4)
             (pred_2 ?v10)
             (pred_6 ?v2)
             (pred_12 ?v3)
             (pred_11 ?v4)
             (pred_5 ?v2)
             (pred_9 ?v4)
             (pred_8 ))



(:action op_3
:parameters (?v8 ?v7 ?v5 ?v11)
:precondition (and (pred_2 ?v8) (pred_2 ?v7) (pred_6 ?v5) (pred_12 ?v11)
          (pred_10 ?v8 ?v7) (pred_3 ?v5 ?v11)
                   (pred_7 ?v7 ?v11) (pred_4 ?v8) 
                   (pred_11 ?v7) (pred_5 ?v5))
:effect (and  (pred_9 ?v7) (not (pred_11 ?v7))))


(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_2 ?v8) (pred_2 ?v9)
               (pred_4 ?v8) (pred_10 ?v8 ?v9) (pred_9 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v8))))

(:action op_2
:parameters (?v8 ?v5)
:precondition (and (pred_2 ?v8) (pred_6 ?v5) 
                  (pred_4 ?v8) (pred_1 ?v5 ?v8) (pred_8 ))
:effect (and (pred_5 ?v5)
   (not (pred_1 ?v5 ?v8)) (not (pred_8 ))))


(:action op_1
:parameters (?v8 ?v1 ?v13)
:precondition (and (pred_2 ?v8) (pred_6 ?v1) (pred_6 ?v13)
                  (pred_4 ?v8) (pred_5 ?v13) (pred_1 ?v1 ?v8))
:effect (and (pred_5 ?v1) (pred_1 ?v13 ?v8)
        (not (pred_5 ?v13)) (not (pred_1 ?v1 ?v8))))

(:action op_4
:parameters (?v8 ?v5)
:precondition (and (pred_2 ?v8) (pred_6 ?v5) 
                  (pred_4 ?v8) (pred_5 ?v5))
:effect (and (pred_8 ) (pred_1 ?v5 ?v8) (not (pred_5 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_25 obj_04 obj_26 obj_13 obj_23 obj_19 obj_27 obj_10 obj_06 obj_22 obj_21 obj_01 obj_09 obj_03 obj_30 obj_17 obj_20 obj_05 obj_11 obj_18 obj_14 obj_12 obj_24 obj_28
    obj_02 obj_16
    obj_07 obj_15 obj_08
    )

    (:init
       (pred_8)

       (pred_2 obj_29)
       (pred_2 obj_25)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_2 obj_13)
       (pred_2 obj_23)
       (pred_2 obj_19)
       (pred_2 obj_27)
       (pred_2 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_22)
       (pred_2 obj_21)
       (pred_2 obj_01)
       (pred_2 obj_09)
       (pred_2 obj_03)
       (pred_2 obj_30)
       (pred_2 obj_17)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_18)
       (pred_2 obj_14)
       (pred_2 obj_12)
       (pred_2 obj_24)
       (pred_2 obj_28)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_08)

       (pred_10 obj_29 obj_23)
       (pred_10 obj_29 obj_25)
       (pred_10 obj_25 obj_19)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_25 obj_29)
       (pred_10 obj_04 obj_27)
       (pred_10 obj_04 obj_26)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_26 obj_10)
       (pred_10 obj_26 obj_13)
       (pred_10 obj_26 obj_04)
       (pred_10 obj_13 obj_06)
       (pred_10 obj_13 obj_26)
       (pred_10 obj_23 obj_22)
       (pred_10 obj_23 obj_19)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_19 obj_27)
       (pred_10 obj_19 obj_25)
       (pred_10 obj_19 obj_23)
       (pred_10 obj_27 obj_01)
       (pred_10 obj_27 obj_10)
       (pred_10 obj_27 obj_04)
       (pred_10 obj_27 obj_19)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_26)
       (pred_10 obj_10 obj_27)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_22 obj_30)
       (pred_10 obj_22 obj_21)
       (pred_10 obj_22 obj_23)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_22)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_01 obj_27)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_30 obj_18)
       (pred_10 obj_30 obj_17)
       (pred_10 obj_30 obj_22)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_17 obj_30)
       (pred_10 obj_20 obj_12)
       (pred_10 obj_20 obj_05)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_05 obj_24)
       (pred_10 obj_05 obj_11)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_11 obj_28)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_30)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_12 obj_24)
       (pred_10 obj_12 obj_20)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_24 obj_28)
       (pred_10 obj_24 obj_05)
       (pred_10 obj_24 obj_12)
       (pred_10 obj_28 obj_11)
       (pred_10 obj_28 obj_24)
       (pred_11 obj_03)
       (pred_11 obj_24)
       (pred_11 obj_28)
       (pred_7  obj_03 obj_02)
       (pred_7  obj_24 obj_16)
       (pred_7  obj_28 obj_16)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_04)
       (pred_9 obj_26)
       (pred_9 obj_13)
       (pred_9 obj_23)
       (pred_9 obj_19)
       (pred_9 obj_27)
       (pred_9 obj_10)
       (pred_9 obj_06)
       (pred_9 obj_22)
       (pred_9 obj_21)
       (pred_9 obj_01)
       (pred_9 obj_09)
       (pred_9 obj_30)
       (pred_9 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_18)
       (pred_9 obj_14)
       (pred_9 obj_12)

       (pred_3  obj_07 obj_02)
       (pred_3  obj_15 obj_16)
       (pred_3  obj_08 obj_16)
       (pred_1 obj_07 obj_14)
       (pred_1 obj_15 obj_14)
       (pred_1 obj_08 obj_19)
       (pred_4 obj_27)
    )

    (:goal (and
       (pred_1 obj_07 obj_19)
       (pred_1 obj_08 obj_25)
    ))
(:constraints
  (always (not (pred_4 obj_17)))
)
)

; plan
1. (op_5 obj_27 obj_19)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_19)
   goals met: 0 of 2
2. (op_2 obj_19 obj_08)
   deleted: (pred_1 obj_08 obj_19) (pred_8)
   added: (pred_5 obj_08)
   goals met: 0 of 2
3. (op_5 obj_19 obj_25)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_25)
   goals met: 0 of 2
4. (op_4 obj_25 obj_08)
   deleted: (pred_5 obj_08)
   added: (pred_8) (pred_1 obj_08 obj_25)
   goals met: 1 of 2
5. (op_5 obj_25 obj_19)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_19)
   goals met: 1 of 2
6. (op_5 obj_19 obj_21)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_21)
   goals met: 1 of 2
7. (op_5 obj_21 obj_22)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_22)
   goals met: 1 of 2
8. (op_5 obj_22 obj_30)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_30)
   goals met: 1 of 2
9. (op_5 obj_30 obj_18)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_18)
   goals met: 1 of 2
10. (op_5 obj_18 obj_14)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_14)
   goals met: 1 of 2
11. (op_2 obj_14 obj_07)
   deleted: (pred_1 obj_07 obj_14) (pred_8)
   added: (pred_5 obj_07)
   goals met: 1 of 2
12. (op_5 obj_14 obj_18)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_30)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_30)
   goals met: 1 of 2
14. (op_5 obj_30 obj_22)
   deleted: (pred_4 obj_30)
   added: (pred_4 obj_22)
   goals met: 1 of 2
15. (op_5 obj_22 obj_23)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_23)
   goals met: 1 of 2
16. (op_5 obj_23 obj_19)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_19)
   goals met: 1 of 2
17. (op_4 obj_19 obj_07)
   deleted: (pred_5 obj_07)
   added: (pred_8) (pred_1 obj_07 obj_19)
   goals met: 2 of 2
